create-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sch="http://dau.lam.net/service">
   <soapenv:Header/>
   <soapenv:Body >
      <sch:createCarRequest>
         <name>Hummer H4</name>
         <color>WHITE</color>
         <fuelAmount>10</fuelAmount>
         <carType>GAS</carType>
      </sch:createCarRequest>
   </soapenv:Body>
</soapenv:Envelope>
